Checking the problems before solution

In [42]:
import pandas as pd
import numpy as np

In [43]:
students = {
    "student_id" : [1,2,3,4,5,6,7,8],
    "first" : ["Anish", "Ramish",None, "Samish", np.nan,"Bamish", np.nan, 'NA'],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki", "Mainali", np.nan, np.nan, 'Missing'],
    "email" : [None, "mainaliramish89@gmail.com", 
               "shresthasamish28@gmail.com", None,"bamishkarki819@gmail.com",
               "mainaliramish89@gmail.com", np.nan, 'Missing'],
    "age": ['23', '24', '22', '26', '27', None, None, 'Missing']

}
mydf = pd.DataFrame(students)
mydf.set_index('student_id', inplace=True)
mydf

             first      last                       email      age
student_id
1            Anish    Khadka                        None       23
2           Ramish   Mainali   mainaliramish89@gmail.com       24
3             None  Shrestha  shresthasamish28@gmail.com       22
4           Samish     Karki                        None       26
5              NaN   Mainali    bamishkarki819@gmail.com       27
6           Bamish       NaN   mainaliramish89@gmail.com     None
7              NaN       NaN                         NaN     None
8               NA   Missing                     Missing  Missing

In [44]:
mydf.replace(['Missing', 'None', 'NA', None], np.nan, inplace=True)
mydf

             first      last                       email  age
student_id
1            Anish    Khadka                         NaN   23
2           Ramish   Mainali   mainaliramish89@gmail.com   24
3              NaN  Shrestha  shresthasamish28@gmail.com   22
4           Samish     Karki                         NaN   26
5              NaN   Mainali    bamishkarki819@gmail.com   27
6           Bamish       NaN   mainaliramish89@gmail.com  NaN
7              NaN       NaN                         NaN  NaN
8              NaN       NaN                         NaN  NaN

In [45]:
# mydf.loc[mydf['email'].duplicated(keep='first'), 'email'] = np.nan

In [46]:
mydf

             first      last                       email  age
student_id
1            Anish    Khadka                         NaN   23
2           Ramish   Mainali   mainaliramish89@gmail.com   24
3              NaN  Shrestha  shresthasamish28@gmail.com   22
4           Samish     Karki                         NaN   26
5              NaN   Mainali    bamishkarki819@gmail.com   27
6           Bamish       NaN   mainaliramish89@gmail.com  NaN
7              NaN       NaN                         NaN  NaN
8              NaN       NaN                         NaN  NaN

In [47]:
# Keeping only unique values
mydf.drop_duplicates(subset=['email'], keep='first', inplace=True)
mydf

             first      last                       email age
student_id
1            Anish    Khadka                         NaN  23
2           Ramish   Mainali   mainaliramish89@gmail.com  24
3              NaN  Shrestha  shresthasamish28@gmail.com  22
5              NaN   Mainali    bamishkarki819@gmail.com  27

Q. Keep only the unique values in email, keep the first occurence.

In [48]:
# mydf.drop_duplicates(subset=['email'], keep='first')